
/* AppController */
"BetterZip will only run on macOS 10.10 (Yosemite) or later systems." = "BetterZip将只运行在macOS 10.10 (Yosemite) 或者更新的系统。";
"Quit!" = "退出！";
"Sorry!" = "抱歉！";
"https://macitbetter.com/contact" = "mailto:betterzip@macitbetter.com";
"https://macitbetter.com/" = "https://macitbetter.com/";
"http://www.win-rar.com/" = "http://www.win-rar.com/";

/* helpers */
"Last modified: %@\nSize: %@" = "最后一次更改：%@\n大小：%@";

/* ReplaceExistingFiles */
"An item named %@ already exists in this location. Do you want to replace it with the one you are extracting?" = "当前文件夹已经存在名为 %@ 的项目，您希望用解压缩得到的项目替换原项目吗？";
"An item named %@ already exists in this location inside the archive. Do you want to replace it with the one you are adding?" = "压缩文件中的当前文件夹内已经存在名为 %@ 的项目，您希望用尝试添加的项目替换原项目吗？";
"File in archive:" = "压缩文件中的文件：";
"File on disc:" = "磁盘中的文件：";

/* ZipDocument */
"Zip Format (recommended)" = "Zip 格式（推荐）";
"TAR Format, uncompressed (tar)" = "TAR 格式，未压缩（tar）";
"TAR Format, GZip compressed (tgz)" = "TAR 格式，GZip 压缩（tgz）"; 
"TAR Format, BZip2 compressed (tbz)" = "TAR 格式，BZip2 压缩（tbz）";
"7-Zip Format (best compression)" = "7-Zip 格式（最高压缩率）";
"RAR Format" = "RAR 格式";
"Extract All" = "全部解压";
"Extract all files and folders from the archive" = "从压缩文件中解压缩所有的文件和文件夹";
"Extract" = "解压缩";
"Extract the selected files or folders from the archive" = "从压缩文件中解压缩已选择的文件或文件夹";
"Extracting archive: %@" = "正在解压缩文件：%@";
"Opening archive with %d items. Ugh, this is going to take a while..." = "正在打开包含%d个项目的压缩文件，这需要一些时间…";
"Opening archive with %d items" = "正在打开包含%d个文件的压缩文件";
"Check for updates on startup?" = "程序启动时检查更新吗？";
"Would you like %@ to check for updates on startup? You can initiate the check manually from the preferences window at any time." = "您希望 %@ 在启动时检查更新吗？您可以在任何时候通过偏好设置窗口手动检查更新。";
"Yes" = "是";
"No" = "否";
"Are you sure you want to overwrite the original archive?" = "您确定要替换原压缩文件吗？";
"Warning: Saving cannot be undone" = "警告：存储过程不可逆";
"Save" = "存储";
"Don't Save" = "不保存";
"Saving archive: %@ of %@" = "正在存储压缩文件：第%@个，共%@个";
"Extracting items from archive: %@ of %@" = "正在解压缩压缩文件：第%@个，共%@个";
"Add" = "添加";
"Open" = "打开";
"Add Items" = "添加项目";
"Extract Here" = "解压到这里";
"Warning" = "警告";
"%@ is not handled by any application. Try to extract the file and use Finder to open it." = "%@ 没有与任何程序关联，尝试解压缩文件并使用 Finder 打开。";
"OK" = "确定";
"Delete Items" = "删除项目";
"You can't move an item into one of its subfolders!" = "您不能把项目移动到其自身的子文件夹中！";
"Move Items" = "移动项目";
"BetterZip will now remove Mac specific files from the archive." = "BetterZip 即将从压缩文件中移除Mac特殊文件。";
"Clean now" = "立即清理";
"Cancel" = "取消";
"Clean Archive" = "清理压缩文件";
"Change Archive Mode" = "切换压缩模式";
"Archive" = "压缩文件";
"Add to %@..." = "添加到 %@...";
"Extract All..." = "全部解压...";
"Extract Selected..." = "解压已选文件...";
"Save the archive" = "存储压缩文件";
"Add a new file or folder to the archive" = "向压缩文件中添加新的文件或文件夹";
"Extract files or folders from the archive" = "从压缩文件中解压缩文件或文件夹";
"View" = "查看";
"View the selected file" = "查看选择的文件";
"Delete" = "删除";
"Delete the selected files or folders from the archive" = "从压缩文件中删除选择的文件或文件夹？";
"Search" = "搜索";
"Search the archive file" = "在压缩文件中搜索";
"Clean" = "清理";
"Stop" = "停止";
"Ignore and go on" = "忽略并继续";
"The file %@ could not be added to the archive. Maybe the system disc is full?" = "文件 %@ 无法添加到压缩文件，也许系统磁盘已满？";
"There is not enough free space on the destination drive." = "目标驱动器没有足够的空间。";
"Loading archive: %@" = "正在加载压缩文件：%@";
"External command returned: %d\n" = "外部命令返回：%d\n";
"Saving archive failed" = "存储压缩文件的操作失败";
"You don't have permission to write to this folder." = "您不具备在该文件夹中的写入权限。";
"An unknown error occurred." = "发生了一个未知错误。";
"New Folder" = "新建文件夹";
"Create New Folder" = "新建文件夹";
"Error" = "错误";
"Create a new folder in the selected place inside the archive." = "在压缩文件中的所选位置创建一个新的文件夹。";
"An item with this name already exists in this folder!" = "该文件夹中已经存在一个同名项目了！";
"Do you want to save the changes you made in the document %@?" = "您想存储您对文件%@所做的修改吗？";
"Your changes will be lost if you don't save them." = "如果不存储，您的改动将会丢失。";
"The archive extraction failed." = "解压缩失败。";
"Maybe, there is not enough free space on the destination drive. Or the password is incorrect." = "目标磁盘已满或密码不正确。";
"Rename Item" = "重命名";
"Opening archive failed" = "无法打开压缩文件";
"Not encrypted" = "未加密";
"Weak (PKZip2 compatible)" = "弱（PKZip2 兼容）";
"Strong (AES-256)" = "强（AES-256）";
"untitled folder" = "未命名的文件夹";
"BetterZip Temporary Folder" = "BetterZip 临时文件夹"; 
"(incl. %d hidden)" = "（包含%d个隐藏项目）";
"%d selected, uncompressed size: %@ %@" = "选择了%d个项目，未压缩大小：%@ %@";
"%d items, uncompressed size: %@ %@" = "%d个项目，未压缩大小：%@ %@";
"%d item, uncompressed size: %@ %@" = "%d个项目，未压缩大小：%@ %@";
"BetterZip will now remove one file matching the patterns configured in the preferences window from the archive." = "根据偏好设置中的设定的模式，BetterZip 将从压缩文件中移除一个文件。";
"BetterZip will now remove %d files matching the patterns configured in the preferences window from the archive." = "根据偏好设置中的筛选列表内您所制定的格式，BetterZip 将从压缩文件中移除%d个文件。";
"BetterZip will now remove one Mac specific file from the archive." = "BetterZip 将从压缩文件中移除一个Mac特殊文件。";
"BetterZip will now remove %d Mac specific files from the archive." = "BetterZip 将从压缩文件中移除%d个Mac特殊文件。";
"Remove" = "移除";
"BetterZip cannot extract to this folder. Maybe you don't have write access." = "BetterZip 无法解压到该文件夹，也许您不具备写权限。";
"Save As..." = "另存为...";
"Save the archive with another name." = "以其他名称存储压缩文件。";
"Cleaning" = "清理";
"No compression" = "不压缩"; 
"Fast, but larger archives" = "速度快，但是压缩文件体积较大";
"Normal" = "正常";
"Best, but slower operation" = "最高，但是压缩速度更慢";
"Remove files matching the patterns configured in the preferences window from the archive." = "正在根据偏好设置中选中的模式从压缩文件中移除文件。";
"File Types" = "文件类型";
"N/A" = "不适用";
"Multiple files" = "多个文件";
"No files selected" = "没有选择文件";
"A volume is missing: /%s." = "丢失了一个卷：/%s.";
"Close" = "关闭";
"Strong (AES-256) with header encryption" = "强（AES-256），包含文件头加密";


/* PreferenceController */
"Last checked: " = "最后一次检查：";
"General" = "通用设置";
"Columns" = "列";
"Advanced" = "高级";
"Helpers" = "程序助手";
"Use RAR" = "使用 RAR";
"Never" = "从不";
"never" = "从不";
"Next to original" = "在原文件旁边";


/* V 2.0 */
"Cancel the operation" = "取消操作";
"Reveal in Finder" = "在Finder中显示";
"Passwords" = "密码";
"no errors" = "无错误";
"with errors" = "有错误";
"cancelled" = "已取消";
"Extracted %@" = "已解压 %@";
"Extracting %@" = "正在解压 %@";
"Compressing %@" = "正在压缩 %@";
"Extracting items temporarily" = "正在临时地解压缩项目";
"%@ of %@" = "%@ 已完成，共 %@";
"%@ copy" = "%@拷贝";
"Extract to..." = "解压到...";
"The archive could not be extracted completely. It may be damaged." = "压缩文件无法被完整解压，它可能已经损坏。";
"This archive appears to be damaged." = "该压缩文件可能已经损坏。";
"The archive could not be extracted." = "压缩文件无法被解压。";
"It is either damaged or in an unsupported format." = "它可能已损坏，或者是一种不支持的格式。";
"BetterZip Recovered Files" = "BetterZip 已恢复文件";
"Multiple Copies Installed" = "安装了多个拷贝";
"Quit and Reveal in Finder" = "退出并在 Finder 中显示";
"Queued for extraction" = "已加入解压缩队列";
"Queued for compression" = "已加入压缩队列";
"The archive tests failed." = "压缩文件测试失败。";
"The archive is either damaged or in an unsupported format." = "压缩文件可能已损坏，或者是一种不支持的格式。";
"Test" = "测试";
"Testing: %@\n" = "正在测试：%@\n";
"Test the archive" = "测试压缩文件";
"Running script" = "运行脚本";
"Show Favorites" = "显示收藏夹";
"Hide Favorites" = "隐藏收藏夹";
"Show Preview" = "显示预览";
"Hide Preview" = "隐藏预览";
"<new password>" = "<新密码>";
"The transcript window may contain further details." = "清单窗口可能包含更多细节。";
"The file %@ has been modified." = "文件 %@ 已经被更改。";
"Do you want to save the changes back to the archive?" = "您希望将更改存储回压缩文件吗？";
"Update File" = "更新文件";
"Ignore Changes" = "忽略更改";
"Ignore This Time" = "仅这次忽略";
"Symbolic Link (no preview possible)" = "符号连接（不能预览）";
"Use for subsequent archives" = "应用到后续的压缩文件";
"Use this password for the new archive" = "为新的压缩文件使用该密码";
"This is not the password you are looking for." = "这不是您正在寻找的密码。";
"Edit Presets..." = "编辑预设...";
"Show save panel" = "显示存储面板";
"XAR Format" = "XAR 格式";
"Presets" = "预置";
"Testing archive %@" = "正在测试压缩文件 %@";
"Archive test successful" = "压缩文件测试成功";
"The archive test was completed successfully." = "压缩文件测试成功完成。";
"Today" = "今日";
"Yesterday" = "昨天";
"Go to the win.rar GmbH web site" = "前往 win.rar GmbH 网站";
"Extracting items from %@" = "正在解压缩压缩文件：第%@个";
"The rar helper could not be found." = "未找到RAR助手。";
"Please set the correct path in Preferences > Helpers or choose a different format for saving." = "请在 偏好设置 > 程序助手 中设置正确的路径，或选择其他的格式存储。";
"Merge Folders" = "合并文件夹";
"Keep Both" = "同时保持二者";
"Apply to all folders" = "应用到所有文件夹";
"Apply to all" = "应用到所有";
"Do you want to extract the %d archives that were found inside the selected folders?" = "您想到解压缩已选文件夹中包含的 %d 个压缩文件吗？";
"To ignore the selected folders and only extract directly selected archives click “Extract Selected Only”." = "若要忽略选择的文件夹，并且仅解压缩直接选择的压缩文件，请点击“仅解压缩已选文件”。";
"Extract Selected Only" = "仅解压缩已选文件";
"Archive Creation Complete" = "压缩文件创建完成";
"Archive Extraction Complete" = "解压缩操作完成";
"All Queued Archive Operations Complete" = "队列中的所有操作完成";
"<new preset>" = "<新的预置>";
"Other folder..." = "其他文件夹...";
/* open with other application */
"Other..." = "其他...";
"Compress" = "压缩";
"Saving archive %@" = "正在保存压缩文件 %@";
"Compressed %@" = "已压缩 %@";
"An error occurred" = "发生了一个错误";
"Use this preset as default in the toolbar" = "在工具栏中使用此预设作为默认设置";
"Use this preset as service" = "将此预设应用为服务";

/* added in BetterZip 3 */
"Adding files to archive %@" = "将文件添加到压缩文件%@";
"When in Direct Mode, all archive operations are immediate and cannot be undone." = "在“立即执行模式”下，所有的操作都是直接的，不能被撤销。";

/* the two possible labels of the action button in the "file replace" alert panel */
"Update" = "更新";
"Replace" = "替换";

"An item named %@ already exists in this location inside the archive. Do you want to update it?" = "当前文件夹内已经存在名为 %@ 的项目，您希望更新吗？";

"The archive cannot be created." = "无法存档压缩文件";
"BetterZip will now remove one file matching your patterns from the archive." = "根据您指定的筛选格式，BetterZip 将从压缩文件中移除一个文件。";
"BetterZip will now remove %d files matching your patterns from the archive." = "根据您指定的筛选格式，BetterZip 将从压缩文件中移除%d个文件。";
"After filtering, there are no files left to archive." = "筛选后，没有留下的压缩文件。";
"macOS returned this error:" = "macOS返回此错误";
"Use this pattern to specify which files and folders to add to the archive:" = "使用当前模式可以指定将哪些文件和文件夹添加到压缩文件：";
"Add Files to Archive" = "将文件添加到压缩文件";
"Use this pattern to delete files and folders from the archive:" = "使用当前模式从压缩文件中删除文件和文件夹";
"Delete Files From Archive" = "从压缩文件中删除文件";

/* displayed in the file types table for user defined extensions */
"<Click to add your own>" = "<点击以添加你自己的>";

/* new compression levels */
"High, but slower operation" = "高，但速度较慢";
"Best (solid, slow extraction)" = "最高";

/* Preferences window - name of the tab to manage filter patterns */
"Filtering" = "筛选列表";

/* Tooltip for the delete with pattern toolbar button */
"Delete with pattern" = "删除指定格式的文件";

"<new pattern>" = "-";

/* warning when a user adds an archive comment, but the current format doesn’t support that (user can still save with an other format */
"You should save this archive with ZIP or RAR format or your comment will be lost." = "您应当以ZIP或RAR格式保存此压缩文件，否则您的注释将丢失。";

/* possible button labels for setting and clearing passwords in the save presets configuration */
"Set" = "设置";
"Clear" = "清除";

"CPIO Format, uncompressed (cpio)" = "CPIO格式，压缩的(CPIO)";
"TAR Format, xz compressed (txz)" = "TAR 格式，XZ压缩（txz）";

/* title of the OK button in the file open panel used to locate the temp folder or standard opening program */ 
"Use" = "使用";

/* possible file status strings */
"Modified" = "修改";
"Moved" = "移动";
"Added" = "添加";
"Updated" = "更新";

"An error occurred opening %@. Do you want to try to open the archive anyway?" = "打开%@出现错误。您无论如何都希望打开吗?";
"Cancel Opening" = "取消打开";
"Open Anyway" = "无论如何都要打开";

/* added in BetterZip 4 */

/* Default title for dynamic preset services */
"Compress with Preset %@" = "压缩预设%@";
"Extract with Preset %@" = "使用%@预设解压";
"Service Name" = "服务名称";
"Comment Text" = "注释文字";

"Caution" = "警告";
"Do not enable this option, if you are not in the habit of making regular backups of your data. BetterZip will not warn you before overwriting files, if you use a preset with the overwrite switch enabled. Files can be lost. Use at your own risk." = "如果您不习惯对数据进行定期备份，请勿启用此选项。如果使用启用了覆盖开关，BetterZip在覆盖文件之前不会发出警告。文件可能丢失。请慎重考虑风险。";
"Activate" = "启用";
"Trash" = "垃圾";
"Don't move" = "不移动";
"+pwd" = "+ PWD";
"Reload Drop Bar" = "重载Drop Bar";

"The file %@ could not be extracted. %@\n\nThe last error macOS reported was:\n\"%s\"" = "文件 %@ 无法解压。%@\\n\\nmacOS 汇报的最后一个错误是：%s";
"The password may be incorrect." = "密码错误";
"Archive Extraction Failed" = "解压缩操作失败";
"Archive Creation Failed" = "压缩文件创建失败";
"Archive Test Successful" = "压缩文件测试成功";
"Archive Test Failed" = "压缩文件测试失败";

"The archive disappeared" = "压缩文件缺失";
"You can still browse the contents, but all archive operations will fail. \nDo you want to close the window?" = "您仍然可以浏览内容， 但是所有的压缩操作都将失败。请问您想要关闭窗口吗？";
"Ignore" = "忽略";

"An error occurred opening %@. Do you want to try to repair the archive?" = "打开%@时出错。你想尝试修复档案吗？";
"The archive could not be extracted completely. It may be damaged. Do you want to try to repair the archive?" = "压缩文件无法完成解压。它可能已经损坏。请问您需要尝试修复吗?";
"Repair" = "修复";
"%@ (damaged)" = "%@(损坏)";

"Drag items here to compress or extract" = "把项目拖到这里来压缩或解压缩";
"Drop archives here to extract" = "放入压缩文件进行解压缩";
"Drop the archives here to open them" = "把压缩文件拖到这里来打开";
"Drop items here to compress" = "放入文件进行压缩";
"Drop the files here to add them to a new archive" = "放入文件以添加到压缩文件";
"Choose from your favorite presets" = "从您最喜欢的预设中进行选择";
"Test the archive integrity" = "测试压缩文件完整性";
"Open and browse the archive" = "打开和浏览压缩文件";
"Add the items to a new archive" = "将项目添加到新的存档";
"Trash" = "垃圾";

"Compress with BetterZip" = "使用 BetterZip 压缩";
"Extract with BetterZip" = "使用 BetterZip 解压";

"Reveal in Finder" = "在Finder中显示";
"Cancel the operation" = "取消操作";

"This archive doesn't contain any Mac specific files yet" = "这个压缩文件没有包含任何Mac特定文件";
"Do you want to keep it that way or add metadata to your archive?" = "您是想保持这种方式，还是将元数据添加到压缩文件中？";
"Add Mac Stuff" = "添加Mac Stuff";
"Keep Mac Stuff out" = "保持Mac Stuff出现";

"System Default" = "系统默认";
"One password per line:" = "每一行一个密码";
"Back" = "返回";
"Unlock Password Manager…" = "解锁密码管理器…";
"Lock Password Manager" = "锁住密码管理器";
"Archives" = "压缩文件";
"Archive Types" = "关联的文件类型";
"Files" = "文件类型";
"Next to archive" = "下一个压缩文件";
"Choose Master Password" = "Choose Master Password";
